In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    '고객번호' : [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '금액' : [10000, 20000, 30000, 40000, 50000, 60000, 70000]
})

In [3]:
df2 = pd.DataFrame({
    '고객번호' : [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름' : ['라라', '감스트', '인직', '메이플', '스토리', '카트', '라이더']
})

In [4]:
# Merage(병합).join

df1.merge(df2)

   고객번호     금액   이름
0  1001  10000   라라
1  1002  20000  감스트
2  1003  30000   인직
3  1004  40000  메이플
4  1005  50000  스토리
5  1006  60000   카트
6  1007  70000  라이더

In [5]:
df1.loc[0:3]

   고객번호     금액
0  1001  10000
1  1002  20000
2  1003  30000
3  1004  40000

In [6]:
df1.loc[:3]

   고객번호     금액
0  1001  10000
1  1002  20000
2  1003  30000
3  1004  40000

In [ ]:
pd.merge(df1, df2)

# pd.merge(df1, df2, left_on='고객번호', right_on = '고객번호')

In [ ]:
pd.merge(df1, df2, how='left')

In [ ]:
pd.merge(df1, df2, how='right')

In [ ]:
pd.merge(df1, df2, how='outer')